"""Вывести таблицу умножения для числа n
в формате: n * i = z,

n = 3
3 * 1 = 3
...
3 * 10 = 30
"""
n = int(input('Введите число: '))

for i in range(1, 11):
    print(f'{n} * {i} = {n * i}')

print('\n Другой цикл \n')
############
m = 1
while m <= 10:
    print(f'{n} * {m} = {n * m}')
    m = m + 1
